In [1]:
import numpy as np
import pandas as pd

In [3]:
index = [(1, 'A'), (2, 'A'), (1, 'B'), (2, 'B')]
s1 = pd.Series([1.0, 2.0, 3.0, 4.0], index=index)
s1

(1, A)    1.0
(2, A)    2.0
(1, B)    3.0
(2, B)    4.0
dtype: float64

In [6]:
s1[[i for i in s1.index if i[1] == 'A']]

(1, A)    1.0
(2, A)    2.0
dtype: float64

In [7]:
new_index = pd.MultiIndex.from_tuples(index)
new_index

MultiIndex([(1, 'A'),
            (2, 'A'),
            (1, 'B'),
            (2, 'B')],
           )

In [8]:
s1 = s1.reindex(new_index)

In [11]:
s1

1  A    1.0
2  A    2.0
1  B    3.0
2  B    4.0
dtype: float64

In [15]:
s1[:, 'A']

1    1.0
2    2.0
dtype: float64

In [17]:
s1_df = s1.unstack()

In [18]:
s1_df.stack()

1  A    1.0
   B    3.0
2  A    2.0
   B    4.0
dtype: float64

In [19]:
s1

1  A    1.0
2  A    2.0
1  B    3.0
2  B    4.0
dtype: float64

In [21]:
s1_df = pd.DataFrame({'data1': s1, 'data2': [5.0, 6.0, 7.0, 8.0]})

In [22]:
s1_df

     data1  data2
1 A    1.0    5.0
2 A    2.0    6.0
1 B    3.0    7.0
2 B    4.0    8.0

In [24]:
x = s1_df['data1'] + s1_df['data2']

In [26]:
x.unstack()

     A     B
1  6.0  10.0
2  8.0  12.0

In [28]:
df = pd.DataFrame(np.random.rand(4, 2),
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns=['data1', 'data2'])
df

        data1     data2
a 1  0.020472  0.217167
  2  0.374998  0.853378
b 1  0.434622  0.642999
  2  0.380703  0.969205

In [29]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

In [30]:
data

{('California', 2000): 33871648,
 ('California', 2010): 37253956,
 ('Texas', 2000): 20851820,
 ('Texas', 2010): 25145561,
 ('New York', 2000): 18976457,
 ('New York', 2010): 19378102}

In [32]:
s2 = pd.Series(data)

In [33]:
s2[:, 2000]

California    33871648
Texas         20851820
New York      18976457
dtype: int64

In [34]:
s2.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [35]:
s2.unstack().T

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [36]:
pd.MultiIndex.from_arrays([['A','A','B','B'], [1,2,1,2]])

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [37]:
pd.MultiIndex.from_product([['A', 'B'], [1, 2]])

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [38]:
s1

1  A    1.0
2  A    2.0
1  B    3.0
2  B    4.0
dtype: float64

In [39]:
s1.index.names = ['one', 'two']

In [40]:
s1

one  two
1    A      1.0
2    A      2.0
1    B      3.0
2    B      4.0
dtype: float64

In [41]:
s2.index

MultiIndex([('California', 2000),
            ('California', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010),
            (  'New York', 2000),
            (  'New York', 2010)],
           )

In [44]:
s2.index.names = ['State', 'Year']

In [45]:
s2

State       Year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [46]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])

In [48]:
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [49]:
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] -= 10
data += 37

In [50]:
health_data = pd.DataFrame(data, index=index, columns=columns)

In [51]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.3  36.5  26.4  36.4  26.8  37.0
     2      29.8  38.0  27.0  38.5  26.8  37.6
2014 1      26.0  38.2  25.5  37.4  26.5  37.8
     2      26.9  36.8  27.4  36.1  27.6  37.8

In [58]:
health_data.loc[2013]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        25.3  36.5  26.4  36.4  26.8  37.0
2        29.8  38.0  27.0  38.5  26.8  37.6